export default {
    MENU: {
        HOME: 'Главная',
        NEWS: 'Новости',
        KNOWLEDGE_CORE: 'Основная информация',
        CLIENT: 'В Клиент',
    },
    PAGE: {
        HOME: 'Главная',
        NEWS: {
            NAME: 'Новости',
            CREATE: 'Создание новости',
            VIEW: 'Просмотр новости',
            EDIT: 'Редактирование новости',
        },
        KNOWLEDGE_CORE: {
            NAME: 'Основная информация',
            EDIT: 'Редактирование основной информации',
        },
    },
    BUTTON: {
        EDIT: 'Изменить',
        DELETE: 'Удалить',
        SAVE: 'Сохранить',
        CREATE_NEWS: 'Создать новость',
        SAVE_CHANGES: 'Сохранить изменения',
        LOGOUT: 'Выход',
    },
    TABLE: {
        NEWS: {
            NAME: 'Название',
            STATUS: 'Статус',
            DATE: 'Дата',
            ACTIONS: 'Действия',
            DESCRIPTION: 'Описание',
            TOOLTIP_ACTIONS: {
                VIEW: 'Просмотр',
                EDIT: 'Изменить',
                DELETE: 'Удалить',
            },
            SORT: {
                NAME: 'Сортировать по названию',
                DATE: 'Сортировать по дате',
            },
            SEARCH: {
                NAME: 'Введите название',
                BUTTON: 'Поиск',
            },
            RESET: {
                BUTTON: 'Сброс',
            },
            PLACEHOLDER: {
                NAME: 'Введите название',
                STATUS: 'Выберите статус',
                DATE: 'Выберите дату',
                DESCRIPTION: 'Введите описание',
            },
        },
        KNOWLEDGE_CORE: {
            DESCRIPTION: 'Описание',
            PHONE: 'Телефон',
            EMAIL: 'Электронная почта',
            ADDRESS: 'Адрес',
            REFERENCES: 'Публикации',
            LAB_LINK: 'Ссылка на сайт лаборатории',
            LAB_LINK_SHORT: 'Ссылка на сайт',
            GITHUB_LINK: 'Ссылка на группу GitHub',
            GITHUB_LINK_SHORT: 'Ссылка на GitHub',
            PLACEHOLDER: {
                DESCRIPTION: 'Введите описание',
                PHONE: 'Введите телефон',
                EMAIL: 'Введите электронную почту',
                ADDRESS: 'Введите адрес',
                REFERENCES: 'Введите публикации',
                LAB_LINK: 'Введите ссылку на сайт лаборатории',
                GITHUB_LINK: 'Введите ссылку на группу GitHub',
            },
        },
    },
    CONFIRM: {
        NEWS: {
            DELETE: 'Вы уверены, что хотите удалить эту новость?',
        },
    },
    MESSAGE: {
        NEWS: {
            TEXT:{
                DESCRIPTION: 'Нет данных',
            },
            SUCCESS: {
                CREATE: 'Новость успешно создана!',
                EDIT: 'Новость успешно изменена!',
                DELETE: 'Новость успешно удалена!',
            },
            ERROR: {
                DELETE: 'Ошибка при удалении новости',
                STATUS: 'Ошибка загрузки статусов',
                CREATING: 'Ошибка при создании новости',
                EDITING: 'Ошибка при редактировании новости',
                ENTER_TITLE: 'Пожалуйста, введите заголовок',
                TITLE_LONGE: 'Название должно быть не длиннее 255 символов',
                SELECT_STATUS: 'Пожалуйста, выберите статус',
                SELECT_DATE: 'Пожалуйста, выберите дату',
            },
        },
        KNOWLEDGE_CORE: {
            SUCCESS: {
                EDIT: 'Основная информация успешно изменена!',
            },
            ERROR: {
                EMAIL: 'Поле электронной почты должно быть действительным адресом электронной почты.',
                EMAIL_LONGE: 'Электронная почта должна быть не длиннее 255 символов',
                EDITING: 'Ошибка при редактировании основной информации',
                PHONE_LONGE: 'Телефон должен быть не длиннее 255 символов',
                ADDRESS_LONGE: 'Адрес должен быть не длиннее 255 символов',
            },
        },
    },
};
