export default {
    MENU: {
        HOME: 'Главная',
        NEWS: 'Новости',
        CLIENT: 'В Клиент',
    },
    PAGE: {
        HOME: 'Главная',
        NEWS: {
            NAME: 'Новости',
            CREATE: 'Создание новости',
            VIEW: 'Просмотр новости',
            EDIT: 'Редактирование новости',
        },
    },
    BUTTON: {
        EDIT: 'Изменить',
        DELETE: 'Удалить',
        SAVE: 'Сохранить',
        CREATE_NEWS: 'Создать новость',
        SAVE_CHANGES: 'Сохранить изменения',
        LOGOUT: 'Выход',
    },
    TABLE: {
        NAME: 'Название',
        STATUS: 'Статус',
        DATE: 'Дата',
        ACTIONS: 'Действия',
        DESCRIPTION: 'Описание',
        TOOLTIP_ACTIONS: {
            VIEW: 'Просмотр',
            EDIT: 'Изменить',
            DELETE: 'Удалить',
        },
        SORT: {
            NAME: 'Сортировать по названию',
            DATE: 'Сортировать по дате',
        },
        SEARCH: {
            NAME: 'Введите название',
            BUTTON: 'Поиск',
        },
        RESET: {
            BUTTON: 'Сброс',
        },
        PLACEHOLDER: {
            NAME: 'Введите название',
            STATUS: 'Выберите статус',
            DATE: 'Выберите дату',
            DESCRIPTION: 'Введите описание',
        },
    },
    CONFIRM: {
        DELETE: 'Вы уверены, что хотите удалить эту новость?',
    },
    MESSAGE: {
        TEXT:{
            DESCRIPTION: 'Нет данных',
        },
        SUCCESS: {
            CREATE: 'Новость успешно создана!',
            EDIT: 'Новость успешно изменена!',
            DELETE: 'Новость успешно удалена!',
        },
        ERROR: {
            DELETE: 'Ошибка при удалении новости',
            STATUS: 'Ошибка загрузки статусов',
            CREATING: 'Ошибка при создании новости',
            EDITING: 'Ошибка при редактировании новости',
            ENTER_TITLE: 'Пожалуйста, введите заголовок',
            TITLE_LONGE: 'Название должно быть не длиннее 255 символов',
            SELECT_STATUS: 'Пожалуйста, выберите статус',
            SELECT_DATE: 'Пожалуйста, выберите дату',
        },
    },
};
